---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideOnlyReference
enum: Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
source: html/946277c7-6e1a-7f6a-7bd3-7693904e74fd.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideOnlyReference

Hide only the referenced face or curve.